In [14]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [15]:
# 浏览器打开数据来源
link = 'https://www.tiobe.com/tiobe-index/'
import webbrowser
webbrowser.open(link)

True

In [39]:
#获取剪切板(报错？不妨换谷歌浏览器打开源网址)
df = pd.read_clipboard()

In [40]:
df

   Feb 2020  Feb 2019  Change Programming Language  Ratings Change.1
0         1         1     NaN                 Java  17.358%   +1.48%
1         2         2     NaN                    C  16.766%   +4.34%
2         3         3     NaN               Python   9.345%   +1.77%
3         4         4     NaN                  C++   6.164%   -1.28%
4         5         7  change                   C#   5.927%   +3.08%
5         6         5  change    Visual Basic .NET   5.862%   -1.23%
6         7         6  change           JavaScript   2.060%   -0.79%
7         8         8     NaN                  PHP   2.018%   -0.25%
8         9         9     NaN                  SQL   1.526%   -0.37%
9        10        20  change                Swift   1.460%   +0.54%

In [41]:
# 按列名访问
df.Ratings

0    17.358%
1    16.766%
2     9.345%
3     6.164%
4     5.927%
5     5.862%
6     2.060%
7     2.018%
8     1.526%
9     1.460%
Name: Ratings, dtype: object

In [48]:
# Series类型
type(df.Ratings)

pandas.core.series.Series

In [49]:
# 访问带空格的列名，字典的方式访问
df['Programming Language']

0                 Java
1                    C
2               Python
3                  C++
4                   C#
5    Visual Basic .NET
6           JavaScript
7                  PHP
8                  SQL
9                Swift
Name: Programming Language, dtype: object

In [55]:
# 可见默认是arange
df.index

RangeIndex(start=0, stop=10, step=1)

In [56]:
df.columns

Index(['Feb 2020', 'Feb 2019', 'Change', 'Programming Language', 'Ratings',
       'Change.1'],
      dtype='object')

In [78]:
# 没有'Feb 2018'index，所以默认值为NaN
df_new = DataFrame(df,columns=['Programming Language','Feb 2020', 'Feb 2019','Feb 2018'])
df_new

  Programming Language  Feb 2020  Feb 2019  Feb 2018
0                 Java         1         1       NaN
1                    C         2         2       NaN
2               Python         3         3       NaN
3                  C++         4         4       NaN
4                   C#         5         7       NaN
5    Visual Basic .NET         6         5       NaN
6           JavaScript         7         6       NaN
7                  PHP         8         8       NaN
8                  SQL         9         9       NaN
9                Swift        10        20       NaN

In [83]:
# 为NaN赋值
df_new['Feb 2018'] = Series(range(0,10))
df_new

  Programming Language  Feb 2020  Feb 2019  Feb 2018
0                 Java         1         1         0
1                    C         2         2         1
2               Python         3         3         2
3                  C++         4         4         3
4                   C#         5         7         4
5    Visual Basic .NET         6         5         5
6           JavaScript         7         6         6
7                  PHP         8         8         7
8                  SQL         9         9         8
9                Swift        10        20         9

In [84]:
# 具体为NaN赋值
df_new['Feb 2018'] = Series([100,200],index=[2,3])
df_new

  Programming Language  Feb 2020  Feb 2019  Feb 2018
0                 Java         1         1       NaN
1                    C         2         2       NaN
2               Python         3         3     100.0
3                  C++         4         4     200.0
4                   C#         5         7       NaN
5    Visual Basic .NET         6         5       NaN
6           JavaScript         7         6       NaN
7                  PHP         8         8       NaN
8                  SQL         9         9       NaN
9                Swift        10        20       NaN

In [85]:
# 按列
df[0:4]

   Feb 2020  Feb 2019 Change Programming Language  Ratings Change.1
0         1         1    NaN                 Java  17.358%   +1.48%
1         2         2    NaN                    C  16.766%   +4.34%
2         3         3    NaN               Python   9.345%   +1.77%
3         4         4    NaN                  C++   6.164%   -1.28%

In [88]:
# 行
df.loc[0]

Feb 2020                      1
Feb 2019                      1
Change                      NaN
Programming Language       Java
Ratings                 17.358%
Change.1                 +1.48%
Name: 0, dtype: object

In [89]:
type(df.loc[0])

pandas.core.series.Series

In [91]:
# Access a group of rows and columns by label(s) or a boolean array.
df.loc[0:4,['Programming Language','Feb 2020']]

  Programming Language  Feb 2020
0                 Java         1
1                    C         2
2               Python         3
3                  C++         4
4                   C#         5

In [92]:
# Purely integer-location based indexing for selection by position.
df.iloc[0:3,0:2]

   Feb 2020  Feb 2019
0         1         1
1         2         2
2         3         3